### Week 3 Assignment: Making Data Management Decisions

The week 3 assignment involves posting the program, the results/output that displays at least 3 of the data managed variables as frequency distributions, and the explanations describing these frequency distributions in terms of the values the variables take, how often they take them, the presence of missing data, etc.

In [65]:
#import libraries
import pandas as pd
import numpy as np

In [66]:
#load dataset
file_path = 'gapminder.csv'
gapminder_df = pd.read_csv(file_path, low_memory=False)

In [67]:
#print out the number of rows (observations) in the dataset
print(len(gapminder_df))

213

In [68]:
#print out number of columns in the dataset
print(len(gapminder_df.columns))

16

#### Select columns needed for the research project

In [69]:
#select the variables needed for project
gapminder_df = gapminder_df[['country', 'incomeperperson','oilperperson', 'co2emissions', 'relectricperperson']]
gapminder_df.head(6)

,country,incomeperperson,oilperperson,co2emissions,relectricperperson
0,Afghanistan,,,75944000,
1,Albania,1914.996551,,223747333.3,636.3413834
2,Algeria,2231.993335,0.420094525,2932108667,590.5098143
3,Andorra,21943.3399,,,
4,Angola,1381.004268,,248358000,172.9992274
5,Antigua and Barbuda,11894.46407,,16225000,

#### Dealing with missing data

In [70]:
#replace empty cells with nan
gapminder_df = gapminder_df.replace([""," "], np.nan, regex=True)

In [71]:
#convert object variables to numeric 

gapminder_df['incomeperperson'] = pd.to_numeric(gapminder_df['incomeperperson'])
gapminder_df['co2emissions'] = pd.to_numeric(gapminder_df['co2emissions'])
gapminder_df['oilperperson'] = pd.to_numeric(gapminder_df['oilperperson'])
gapminder_df['relectricperperson'] = pd.to_numeric(gapminder_df['relectricperperson'])

In [72]:
sub1 = gapminder_df.copy()

In [73]:
sub1.head(10)

,country,incomeperperson,oilperperson,co2emissions,relectricperperson
0,Afghanistan,NaN,NaN,7.594400e+07,NaN
1,Albania,1914.996551,NaN,2.237473e+08,636.341383
2,Algeria,2231.993335,0.420095,2.932109e+09,590.509814
3,Andorra,21943.339900,NaN,NaN,NaN
4,Angola,1381.004268,NaN,2.483580e+08,172.999227
5,NaN,11894.464070,NaN,1.622500e+07,NaN
6,Argentina,10749.419240,0.635944,5.872119e+09,768.428300
7,Armenia,1326.741757,NaN,5.121967e+07,603.763058
8,Aruba,NaN,NaN,3.587100e+07,NaN
9,Australia,25249.986060,1.913026,1.297009e+10,2825.391095

In [74]:
len(sub1)

213

In [75]:
sub1['oilperperson'].isnull().sum()

150

#### Grouping values in variables and calculating secondary variables

In [76]:
#create a function to code the values for oilperperson variable and create a secondary variable 'OilClass' needed for the research.
def OILPERPERSON(row):
    if row['oilperperson'] <= 3:
        return 1
    if row['oilperperson'] > 3 and row['oilperperson'] <= 6:
        return 2
    if row['oilperperson'] > 6 and row['oilperperson'] <= 9:
        return 3
    if row['oilperperson'] > 9 and row['oilperperson'] <= 12:
        return 4
    if row['oilperperson'] > 12 and row['oilperperson'] <= 15:
        return 5

sub1['OilClass'] = sub1.apply(lambda row: OILPERPERSON(row), axis=1)

In [77]:
#create a function to code the values for oilperperson variable and create a secondary variable 'OilClass' needed for the research.
def CO2EMISSIONS(row):
    if row['co2emissions'] <= 70000000000:
        return 1
    if row['co2emissions'] > 70000000000 and row['co2emissions'] <= 140000000000:
        return 2
    if row['co2emissions'] > 140000000000 and row['co2emissions'] <= 210000000000:
        return 3
    if row['co2emissions'] > 210000000000 and row['co2emissions'] <= 280000000000:
        return 4
    if row['co2emissions'] > 280000000000 and row['co2emissions'] <= 350000000000:
        return 5

sub1['Co2Class'] = sub1.apply(lambda row: CO2EMISSIONS(row), axis=1)

In [78]:
#create a function to code the values for oilperperson variable and create a secondary variable 'OilClass' needed for the research.
def RELECTRICPERPERSON(row):
    if row['relectricperperson'] <= 2500:
        return 1
    if row['relectricperperson'] > 2500 and row['relectricperperson'] <= 5000:
        return 2
    if row['relectricperperson'] > 5000 and row['relectricperperson'] <= 7500:
        return 3
    if row['relectricperperson'] > 7500 and row['relectricperperson'] <= 9000:
        return 4
    if row['relectricperperson'] > 9000 and row['relectricperperson'] <= 11500:
        return 5

sub1['ElectricClass'] = sub1.apply(lambda row: RELECTRICPERPERSON(row), axis=1)

In [79]:
#create a function to code the values for oilperperson variable and create a secondary variable 'OilClass' needed for the research.
def INCOMEPERPERSON(row):
    if row['incomeperperson'] <= 22000:
        return 1
    if row['incomeperperson'] > 22000 and row['incomeperperson'] <= 44000:
        return 2
    if row['incomeperperson'] > 44000 and row['incomeperperson'] <= 66000:
        return 3
    if row['incomeperperson'] > 66000 and row['incomeperperson'] <= 88000:
        return 4
    if row['incomeperperson'] > 88000 and row['incomeperperson'] <= 110000:
        return 5

sub1['IncomeClass'] = sub1.apply(lambda row: INCOMEPERPERSON(row), axis=1)

In [80]:
sub1.head(10)

,country,incomeperperson,oilperperson,co2emissions,relectricperperson,OilClass,Co2Class,ElectricClass,IncomeClass
0,Afghanistan,NaN,NaN,7.594400e+07,NaN,NaN,1.0,NaN,NaN
1,Albania,1914.996551,NaN,2.237473e+08,636.341383,NaN,1.0,1.0,1.0
2,Algeria,2231.993335,0.420095,2.932109e+09,590.509814,1.0,1.0,1.0,1.0
3,Andorra,21943.339900,NaN,NaN,NaN,NaN,NaN,NaN,1.0
4,Angola,1381.004268,NaN,2.483580e+08,172.999227,NaN,1.0,1.0,1.0
5,NaN,11894.464070,NaN,1.622500e+07,NaN,NaN,1.0,NaN,1.0
6,Argentina,10749.419240,0.635944,5.872119e+09,768.428300,1.0,1.0,1.0,1.0
7,Armenia,1326.741757,NaN,5.121967e+07,603.763058,NaN,1.0,1.0,1.0
8,Aruba,NaN,NaN,3.587100e+07,NaN,NaN,1.0,NaN,NaN
9,Australia,25249.986060,1.913026,1.297009e+10,2825.391095,1.0,1.0,2.0,2.0

#### Create Frequency tables for the chosen variables using value_counts()

In [81]:
#create frequency tables for three variables in the dataset
#frequency distribution of OilClass variable
f1 = sub1['OilClass'].value_counts(sort=False, dropna=False)
p1 = sub1['OilClass'].value_counts(sort=False, normalize=True, dropna=False)
#frequency distribution of co2emissions variable 
f2 = sub1['Co2Class'].value_counts(sort=False, dropna=False)
p2 = sub1['Co2Class'].value_counts(sort=False, normalize=True, dropna=False)
#frequency distribution of relectricperperson variable
f3 = sub1['ElectricClass'].value_counts(sort=False, dropna=False)
p3 = sub1['ElectricClass'].value_counts(sort=False, normalize=True, dropna=False)
#frequency distribution of incomeperperson variable
f4 = sub1['IncomeClass'].value_counts(sort=False, dropna=False)
p4 = sub1['IncomeClass'].value_counts(sort=False, normalize=True, dropna=False)

The frequency distribution of the oilClass variable: (1 = less than 3 tonnes per capita, 2 = 3-6 tonnes per capita, 3 = 7-9 tonnes per capita, 4 = 10-12 tonnes per capita and 5 = 13-15 tonnes per capita.)

In [82]:
#output the frequency of the values in oilclass variable
print('The frequency distribution of the oilClass variable: 1 = less than 3 tonnes per capita, 2 = 3-6 tonnes per capita, 3 = 7-9 tonnes per capita, 4 = 10-12 tonnes per capita and 5 = 13-15 tonnes per capita')
f1.to_frame()

The frequency distribution of the oilClass variable: 1 = less than 3 tonnes per capita, 2 = 3-6 tonnes per capita, 3 = 7-9 tonnes per capita, 4 = 10-12 tonnes per capita and 5 = 13-15 tonnes per capita

     OilClass
NaN       150
1.0        57
2.0         4
3.0         1
5.0         1

In [83]:
#output the percentage of values in the oilclass variable
p1.to_frame()

     OilClass
NaN  0.704225
1.0  0.267606
2.0  0.018779
3.0  0.004695
5.0  0.004695

Frequency distribution of Co2Class variable
(1 = less than 70,000,000,000 metric tons , 2 = 70, 000,000,000 - 140,000,000,000 metric tons, 3 = 140,000,000,000 - 210,000,000,000 metric tons, 4 = 210,000,000,000-280,000,000,000 metric tons and 5 = 280,000,000,000-350,000,000,000 metric tons)

In [84]:
#output the frequency of the values of co2class variable
print('Frequency distribution of Co2Class variable:')
print('1 = less than 70,000,000,000 metric tons , 2 = 70, 000,000,000 - 140,000,000,000 metric tons, 3 = 140,000,000,000 - 210,000,000,000 metric tons, 4 = 210,000,000,000-280,000,000,000 metric tons and 5 = 280,000,000,000-350,000,000,000 metric tons')
f2.to_frame()

Frequency distribution of Co2Class variable:
1 = less than 70,000,000,000 metric tons , 2 = 70, 000,000,000 - 140,000,000,000 metric tons, 3 = 140,000,000,000 - 210,000,000,000 metric tons, 4 = 210,000,000,000-280,000,000,000 metric tons and 5 = 280,000,000,000-350,000,000,000 metric tons

     Co2Class
1.0       197
NaN        13
2.0         2
5.0         1

In [85]:
#output the percentage of the values of co2class variable
p2.to_frame()

     Co2Class
1.0  0.924883
NaN  0.061033
2.0  0.009390
5.0  0.004695

frequency distribution of ElectricClass variable: 
(1 = less than 2500 KwH, 2 = 2500-5000 kWh, 3 = 5000-7500 kWH, 4 = 7500-9000kWh, 5 = 9000-11500 kWh)

In [86]:
#output the frequency of the values of the electricClass variable
print('frequency distribution of ElectricClass variable: ')
print('1 = less than 2500 KwH, 2 = 2500-5000 kWh, 3 = 5000-7500 kWH, 4 = 7500-9000kWh, 5 = 9000-11500 kWh')
f3.to_frame()

frequency distribution of ElectricClass variable:
1 = less than 2500 KwH, 2 = 2500-5000 kWh, 3 = 5000-7500 kWH, 4 = 7500-9000kWh, 5 = 9000-11500 kWh

     ElectricClass
NaN             77
1.0            121
2.0             11
3.0              2
4.0              1
5.0              1

In [87]:
#output the percentage of the values of the electricclass variable
p3.to_frame()

     ElectricClass
NaN       0.361502
1.0       0.568075
2.0       0.051643
3.0       0.009390
4.0       0.004695
5.0       0.004695

Frequency distribution of incomeclass variable:
(1 = GDP per capita less than 22,000 US$, 2 = 22,000-44,000 GDP per capita, 3 = 44,000 - 66,000 GDP per capita, 4 = 66,000 - 88,000 GDP per capita, 5 = 88,000 - 110,000 GDP per capita)

In [88]:
#output the frequency of the values for the incomeclass variable
print('Frequency distribution of incomeclass variable:')
print('1 = GDP per capita less than 22,000 US$, 2 = 22,000-44,000 GDP per capita, 3 = 44,000 - 66,000 GDP per capita, 4 = 66,000 - 88,000 GDP per capita, 5 = 88,000 - 110,000 GDP per capita')
f4.to_frame()

Frequency distribution of incomeclass variable:
1 = GDP per capita less than 22,000 US$, 2 = 22,000-44,000 GDP per capita, 3 = 44,000 - 66,000 GDP per capita, 4 = 66,000 - 88,000 GDP per capita, 5 = 88,000 - 110,000 GDP per capita

     IncomeClass
NaN           23
1.0          163
2.0           23
3.0            2
4.0            1
5.0            1

In [89]:
p4.to_frame()

     IncomeClass
NaN     0.107981
1.0     0.765258
2.0     0.107981
3.0     0.009390
4.0     0.004695
5.0     0.004695